CPP_paper_2/index.org
#+LANGUAGE: ja
#+OPTIONS: \n:t author:nil creator:nil timestamp:nil html-postamble:nil toc:nil num:nil ^:{}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style1.css" />

#+TITLE: C++ 筆記試験(その２)

** 問1
以下のソースコードをビルドし実行した際、コンソールに何が表示されるか答えよ。

*** Base.h
#+BEGIN_SRC c -n
  #ifndef BASE_H
  #define BASE_H

  class Sample1;

  class Base
  {
  public:
      Base();
      virtual ~Base();
      inline void Func1() { Func2(); }

  private:
      virtual void Func2();
      Sample1* m_pSample1;
  };

  #endif // BASE_H
#+END_SRC
-----

*** Base.cpp
#+BEGIN_SRC c -n
  #include "Base.h"
  #include "Sample1.h"
  #include <iostream>

  Base::Base()
  {
      std::cout << "Base::Base()" << std::endl;
      m_pSample1 = new Sample1();
  }

  Base::~Base()
  {
      std::cout << "Base::~Base()" << std::endl;
      delete m_pSample1;
  }

  void Base::Func2()
  {
      m_pSample1->Func();
  }
#+END_SRC
-----

*** Derived.h
#+BEGIN_SRC c -n
  #ifndef DERIVED_H
  #define DERIVED_H

  #include "Base.h"

  class Sample2;

  class Derived : public Base
  {
  public:
      Derived();
      virtual ~Derived();

  private:
      virtual void Func2();
      Sample2* m_pSample2;
  };

  #endif // DERIVED_H
#+END_SRC
-----

