CPP_paper_2/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ 筆記試験(その２)</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">C++ 筆記試験(その２)</h1>

<div id="outline-container-org84e7084" class="outline-2">
<h2 id="org84e7084">問1</h2>
<div class="outline-text-2" id="text-org84e7084">
<p>
以下のソースコードをビルドし実行した際、コンソールに何が表示されるか答えよ。<br />
</p>
</div>

<div id="outline-container-org76cf0a8" class="outline-3">
<h3 id="org76cf0a8">Base.h</h3>
<div class="outline-text-3" id="text-org76cf0a8">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5; background-color: #100a14;">#if</span><span style="color: #bc6ec5; background-color: #100a14;">n</span><span style="color: #bc6ec5; background-color: #100a14;">def</span><span style="background-color: #100a14;"> BASE_H
<span class="linenr"> 2: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#define</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">BASE_H</span><span style="background-color: #100a14;">
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span></span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">class</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">Sample1</span><span style="background-color: #100a14;">;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span></span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">class</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">Base</span><span style="background-color: #100a14;">
<span class="linenr"> 7: </span></span><span style="color: #4f97d7; background-color: #100a14;">{</span><span style="background-color: #100a14;">
<span class="linenr"> 8: </span></span><span style="color: #a45bad; background-color: #100a14;">public</span><span style="background-color: #100a14;">:
<span class="linenr"> 9: </span>    Base</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">10: </span>    virtual ~Base</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">11: </span>    </span><span style="color: #4f97d7; background-color: #100a14; font-weight: bold;">inline</span><span style="background-color: #100a14;"> </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">void</span><span style="background-color: #100a14;"> </span><span style="color: #bc6ec5; background-color: #100a14; font-weight: bold;">Func1</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;"> </span><span style="color: #bc6ec5; background-color: #100a14;">{</span><span style="background-color: #100a14;"> Func2</span><span style="color: #2d9574; background-color: #100a14;">()</span><span style="background-color: #100a14;">; </span><span style="color: #bc6ec5; background-color: #100a14;">}</span><span style="background-color: #100a14;">
<span class="linenr">12: </span>
<span class="linenr">13: </span></span><span style="color: #a45bad; background-color: #100a14;">private</span><span style="background-color: #100a14;">:
<span class="linenr">14: </span>    virtual </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">void</span><span style="background-color: #100a14;"> </span><span style="color: #bc6ec5; background-color: #100a14; font-weight: bold;">Func2</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">15: </span>    </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">Sample1</span><span style="background-color: #100a14;">* </span><span style="color: #7590db; background-color: #100a14;">m_pSample1</span><span style="background-color: #100a14;">;
<span class="linenr">16: </span></span><span style="color: #4f97d7; background-color: #100a14;">}</span><span style="background-color: #100a14;">;
<span class="linenr">17: </span>
<span class="linenr">18: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#endif</span><span style="background-color: #100a14;"> </span><span style="color: #2aa1ae; background-color: #100a14;">// </span><span style="color: #2aa1ae; background-color: #100a14;">BASE_H</span>
</pre>
</div>
<hr />
</div>
</div>

<div id="outline-container-org8cbdb76" class="outline-3">
<h3 id="org8cbdb76">Base.cpp</h3>
<div class="outline-text-3" id="text-org8cbdb76">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5; background-color: #100a14;">#include</span><span style="background-color: #100a14;"> </span><span style="color: #2d9574; background-color: #100a14;">"Base.h"</span><span style="background-color: #100a14;">
<span class="linenr"> 2: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#include</span><span style="background-color: #100a14;"> </span><span style="color: #2d9574; background-color: #100a14;">"Sample1.h"</span><span style="background-color: #100a14;">
<span class="linenr"> 3: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#include</span><span style="background-color: #100a14;"> </span><span style="color: #4f97d7; background-color: #100a14;">&lt;</span><span style="color: #2d9574; background-color: #100a14;">iostream</span><span style="color: #4f97d7; background-color: #100a14;">&gt;</span><span style="background-color: #100a14;">
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>Base::Base</span><span style="color: #4f97d7; background-color: #100a14;">()</span><span style="background-color: #100a14;">
<span class="linenr"> 6: </span></span><span style="color: #4f97d7; background-color: #100a14;">{</span><span style="background-color: #100a14;">
<span class="linenr"> 7: </span>    std::cout &lt;&lt; </span><span style="color: #2d9574; background-color: #100a14;">"Base::Base()"</span><span style="background-color: #100a14;"> &lt;&lt; std::endl;
<span class="linenr"> 8: </span>    m_pSample1 = new Sample1</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr"> 9: </span></span><span style="color: #4f97d7; background-color: #100a14;">}</span><span style="background-color: #100a14;">
<span class="linenr">10: </span>
<span class="linenr">11: </span>Base::~Base</span><span style="color: #4f97d7; background-color: #100a14;">()</span><span style="background-color: #100a14;">
<span class="linenr">12: </span></span><span style="color: #4f97d7; background-color: #100a14;">{</span><span style="background-color: #100a14;">
<span class="linenr">13: </span>    std::cout &lt;&lt; </span><span style="color: #2d9574; background-color: #100a14;">"Base::~Base()"</span><span style="background-color: #100a14;"> &lt;&lt; std::endl;
<span class="linenr">14: </span>    </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">delete</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">m_pSample1</span><span style="background-color: #100a14;">;
<span class="linenr">15: </span></span><span style="color: #4f97d7; background-color: #100a14;">}</span><span style="background-color: #100a14;">
<span class="linenr">16: </span>
<span class="linenr">17: </span></span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">void</span><span style="background-color: #100a14;"> </span><span style="color: #bc6ec5; background-color: #100a14; font-weight: bold;">Base</span><span style="background-color: #100a14;">::Func2</span><span style="color: #4f97d7; background-color: #100a14;">()</span><span style="background-color: #100a14;">
<span class="linenr">18: </span></span><span style="color: #4f97d7; background-color: #100a14;">{</span><span style="background-color: #100a14;">
<span class="linenr">19: </span>    m_pSample1-&gt;Func</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">20: </span></span><span style="color: #4f97d7; background-color: #100a14;">}</span>
</pre>
</div>
<hr />
</div>
</div>

<div id="outline-container-orgac1b08b" class="outline-3">
<h3 id="orgac1b08b">Derived.h</h3>
<div class="outline-text-3" id="text-orgac1b08b">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5; background-color: #100a14;">#if</span><span style="color: #bc6ec5; background-color: #100a14;">n</span><span style="color: #bc6ec5; background-color: #100a14;">def</span><span style="background-color: #100a14;"> DERIVED_H
<span class="linenr"> 2: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#define</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">DERIVED_H</span><span style="background-color: #100a14;">
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#include</span><span style="background-color: #100a14;"> </span><span style="color: #2d9574; background-color: #100a14;">"Base.h"</span><span style="background-color: #100a14;">
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span></span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">class</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">Sample2</span><span style="background-color: #100a14;">;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span></span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">class</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">Derived</span><span style="background-color: #100a14;"> : public Base
<span class="linenr"> 9: </span></span><span style="color: #4f97d7; background-color: #100a14;">{</span><span style="background-color: #100a14;">
<span class="linenr">10: </span></span><span style="color: #a45bad; background-color: #100a14;">public</span><span style="background-color: #100a14;">:
<span class="linenr">11: </span>    Derived</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">12: </span>    virtual ~Derived</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">13: </span>
<span class="linenr">14: </span></span><span style="color: #a45bad; background-color: #100a14;">private</span><span style="background-color: #100a14;">:
<span class="linenr">15: </span>    virtual </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">void</span><span style="background-color: #100a14;"> </span><span style="color: #bc6ec5; background-color: #100a14; font-weight: bold;">Func2</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr">16: </span>    </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">Sample2</span><span style="background-color: #100a14;">* </span><span style="color: #7590db; background-color: #100a14;">m_pSample2</span><span style="background-color: #100a14;">;
<span class="linenr">17: </span></span><span style="color: #4f97d7; background-color: #100a14;">}</span><span style="background-color: #100a14;">;
<span class="linenr">18: </span>
<span class="linenr">19: </span></span><span style="color: #bc6ec5; background-color: #100a14;">#endif</span><span style="background-color: #100a14;"> </span><span style="color: #2aa1ae; background-color: #100a14;">// </span><span style="color: #2aa1ae; background-color: #100a14;">DERIVED_H</span>
</pre>
</div>
<hr />
</div>
</div>
