CPP_paper_2/index.org
*** main.cpp
#+BEGIN_SRC c -n
  #include "Derived.h"

  int main()
  {
      Base* pBase = new Derived();

      pBase->Func1();

      delete pBase;

      while(1);
      return 0;
  }
#+END_SRC
-----

** 問2
Baseクラスのデストラクタを仮想関数にしている理由を述べよ。

** 問3
main.cpp L.5 を以下のように変更してビルドし実行した際、コンソールに何が表示されるか答えよ。
#+BEGIN_SRC c
Base* pBase = new Base();
#+END_SRC

** 問4
Base::m_pSample1が以下のような仕様だったとする。
・Baseクラスのインスタンス生成時点ではSample1クラスのインスタンスを生成しない
・Baseクラスの生存期間内にm_pSample1が指すインスタンスが変更される可能性がある
・Sample1クラスのインスタンスが生成されないままBaseクラスの生存期間が終了する可能性がある

このとき、
・コンストラクタ
・デストラクタ
・m_pSample1へのアクセス時
・Sample1クラスのインスタンス破棄時
のそれぞれについて、どのような点に注意してコーディングすべきか、その理由と併せて答えよ。
