CPP_paper_2/index.html

<div id="outline-container-orgad1795b" class="outline-3">
<h3 id="orgad1795b">main.cpp</h3>
<div class="outline-text-3" id="text-orgad1795b">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5; background-color: #100a14;">#include</span><span style="background-color: #100a14;"> </span><span style="color: #2d9574; background-color: #100a14;">"Derived.h"</span><span style="background-color: #100a14;">
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span></span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">int</span><span style="background-color: #100a14;"> </span><span style="color: #bc6ec5; background-color: #100a14; font-weight: bold;">main</span><span style="color: #4f97d7; background-color: #100a14;">()</span><span style="background-color: #100a14;">
<span class="linenr"> 4: </span></span><span style="color: #4f97d7; background-color: #100a14;">{</span><span style="background-color: #100a14;">
<span class="linenr"> 5: </span>    </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">Base</span><span style="background-color: #100a14;">* </span><span style="color: #7590db; background-color: #100a14;">pBase</span><span style="background-color: #100a14;"> = new Derived</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    pBase-&gt;Func1</span><span style="color: #bc6ec5; background-color: #100a14;">()</span><span style="background-color: #100a14;">;
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    </span><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">delete</span><span style="background-color: #100a14;"> </span><span style="color: #7590db; background-color: #100a14;">pBase</span><span style="background-color: #100a14;">;
<span class="linenr">10: </span>
<span class="linenr">11: </span>    </span><span style="color: #4f97d7; background-color: #100a14; font-weight: bold;">while</span><span style="color: #bc6ec5; background-color: #100a14;">(</span><span style="color: #a45bad; background-color: #100a14;">1</span><span style="color: #bc6ec5; background-color: #100a14;">)</span><span style="background-color: #100a14;">;
<span class="linenr">12: </span>    </span><span style="color: #4f97d7; background-color: #100a14; font-weight: bold;">return</span><span style="background-color: #100a14;"> </span><span style="color: #a45bad; background-color: #100a14;">0</span><span style="background-color: #100a14;">;
<span class="linenr">13: </span></span><span style="color: #4f97d7; background-color: #100a14;">}</span>
</pre>
</div>
<hr />
</div>
</div>
</div>

<div id="outline-container-orgf531bd3" class="outline-2">
<h2 id="orgf531bd3">問2</h2>
<div class="outline-text-2" id="text-orgf531bd3">
<p>
Baseクラスのデストラクタを仮想関数にしている理由を述べよ。<br />
</p>
</div>
</div>

<div id="outline-container-org8f8a48e" class="outline-2">
<h2 id="org8f8a48e">問3</h2>
<div class="outline-text-2" id="text-org8f8a48e">
<p>
main.cpp L.5 を以下のように変更してビルドし実行した際、コンソールに何が表示されるか答えよ。<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; background-color: #100a14; font-weight: bold;">Base</span><span style="background-color: #100a14;">* </span><span style="color: #7590db; background-color: #100a14;">pBase</span><span style="background-color: #100a14;"> = new Base</span><span style="color: #4f97d7; background-color: #100a14;">()</span><span style="background-color: #100a14;">;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb41fee3" class="outline-2">
<h2 id="orgb41fee3">問4</h2>
<div class="outline-text-2" id="text-orgb41fee3">
<p>
Base::m_pSample1が以下のような仕様だったとする。<br />
・Baseクラスのインスタンス生成時点ではSample1クラスのインスタンスを生成しない<br />
・Baseクラスの生存期間内にm_pSample1が指すインスタンスが変更される可能性がある<br />
・Sample1クラスのインスタンスが生成されないままBaseクラスの生存期間が終了する可能性がある<br />
</p>

<p>
このとき、<br />
・コンストラクタ<br />
・デストラクタ<br />
・m_pSample1へのアクセス時<br />
・Sample1クラスのインスタンス破棄時<br />
のそれぞれについて、どのような点に注意してコーディングすべきか、その理由と併せて答えよ。<br />
</p>
</div>
</div>
</div>
</body>
</html>
